<a href="https://colab.research.google.com/github/sajid-munawar/Data_Cleaning_with_python/blob/main/Syntax_Errors.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#  Data Cleaning with Python - Syntax Errors

## 2. Syntax Errors

#### <font color="blue">Pre-requisites</font>

In [30]:
# Pre-requisite
# ---
# Importing pandas library
# ---
# OUR CODE GOES BELOW
# 
import pandas as pd

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [31]:
# Example 1
# --- 
# Spelling mistakes/ Typos
# ---
# Dataset url = http://bit.ly/SampleDataset
# ---
# OUR CODE GOES BELOW
# 

# Loading our dataset
# ---
# 
df = pd.read_csv('http://bit.ly/SampleDataset')

# Previewing our dataset
# ---
# 
df.head()

                NAME        CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [32]:
# Replacing "GERMANYY" with "GERMANY"
# ---
# 
df['COUNTRY'] = df['COUNTRY'].str.replace('GERMANYY', 'GERMANY')
df.head()

                NAME        CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

##### <font color="blue">Example 2</font>

In [33]:
# Example 2
# ---
# White spaces: Stripping the leading and trailing spaces
# ---
# Dataset = http://bit.ly/SampleDataset
# ---
# OUR CODE GOES BELOW
# 

# Observing leading and trailing spaces in the city column
# ---
# 
df['CITY']

0           LISBON
1            LONDON
2            Stockholm
3             BRUSSELS
4               Berlin
5         Brasilia
6            Stockholm
7            LONDON
Name: CITY, dtype: object

In [34]:
# Stripping the leading and trailing spaces
# ---
# 
df['CITY'] = df['CITY'].str.strip()
df['CITY']

0       LISBON
1       LONDON
2    Stockholm
3     BRUSSELS
4       Berlin
5     Brasilia
6    Stockholm
7       LONDON
Name: CITY, dtype: object

##### <font color="blue">Example 3</font>

In [35]:
# Example 3
# ---
# Pad Strings: We can also add pad strings as shown when added to the name column.
# Padding refers to addding (whitespaces or other characters) to every string element in the dataframe column.
# ---
# Dataset url = http://bit.ly/SampleDataset
# ---
# OUR CODE GOES BELOW
# 

# We remove null values to avoid errors while padding
# ---
# 
df.dropna(how ='all', inplace = True) 
  
# We add white spaces to left side 
# ---
# 
df["NAME"]= df["NAME"].str.pad(12, side ='right', fillchar ='_') 

# Previewing our resulting dataset
# ---
# 
df.head()

                NAME       CITY  ... ACCOUNT B  TOTAL ACCOUNT
0       Adi Dako ___     LISBON  ...      4340           6730
1       John Paul___     LONDON  ...     34334          38834
2       Cindy Jules_  Stockholm  ...      5504           8949
3      Arthur Kegels   BRUSSELS  ...      8999            300
4      Freya Bismark     Berlin  ...     19000          26000

[5 rows x 8 columns]

#### <font color="green">Challenges</font>

##### <font color="green">Challenge 1</font>

In [36]:
# Challenge 1
# ---
# Question: Fix the spelling errors in the Team variable within the following variable.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
df=pd.read_csv('http://bit.ly/NBABasketballDataset')
df.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter   oston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [53]:
df['Team']=df['Team'].str.strip().str.replace('oston Celtics','Boston Celtics')
df.head()

            Name             Team  Number  ... Weight            College     Salary
0  Avery Bradley  BBoston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  BBoston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  BBoston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter   Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  BBoston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [54]:
df['Team']=df['Team'].str.strip().str.replace('BBoston Celtics','Boston Celtics')
df.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

##### <font color="green">Challenge 2</font>

In [43]:
# Challenge 2
# ---
# Question: Deal with the leading and trailing whitespaces from variables in the following dataset.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
df=pd.read_csv('http://bit.ly/NBABasketballDataset')
df.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter   oston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [48]:
df['College'].head()

0                Texas
1            Marquette
2    Boston University
3        Georgia State
4                  NaN
Name: College, dtype: object

In [47]:
df['Name']=df['Name'].str.strip()
df['Name'].head()

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

##### <font color="green">Challenge 3</font>

In [52]:
# Challenge 3
# ---
# Question: Add pad strings to the Team column in the given dataset.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
df=pd.read_csv('http://bit.ly/NBABasketballDataset')
print(df['Team'].head())
# df['Team'].head()
df['Team']=df['Team'].str.pad(12,side='right',fillchar='_')
# print(df['Team'])
df['Team'].tail()

0    Boston Celtics
1    Boston Celtics
2    Boston Celtics
3     oston Celtics
4    Boston Celtics
Name: Team, dtype: object

453    Utah Jazz___
454    Utah Jazz___
455    Utah Jazz___
456    Utah Jazz___
457             NaN
Name: Team, dtype: object